//здесь программа по файлам 
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "fract.h"
#include "fract.c"
//ЗАДАНИЕ: ВВЕСТИ ДВЕ ДРОБИ(использовать как структуры) И ВЫПОЛНИТЬ С НИМИ ОПЕРАЦИИ +-*/ С ПОМОЩЬЮ ФУНКЦИЙ
//=================================================
int main(void){
    //значения для ввода в калькулятор
    char simv[1];//введенное с клавиатуры значение для выполнения действия
    struct rational_fraction drob1,drob2,drobotvet;//первая и вторая дробь
    input(&drob1);//вызов функции для записи первой дроби 
    input(&drob2);//вызов функции для записи второй дроби 
    printf("Что необходимо сделать?(+-/*)\n");//ввод символа для выполнения действия
   scanf("%s",&simv[0]);
//=================================================
if (simv[0] == '+') 
{
    add(drob1,drob2,drobotvet); //вызов плюса
}
//=================================================
else if (simv[0] == '-')
{
    sub(drob1,drob2,drobotvet); //вызов минуса
}
//=================================================
else if (simv[0] == '*')
{
    mult(drob1,drob2,drobotvet); //вызов умножения
}
//=================================================
else if (simv[0] == '/')
{
    divide(&drob1,&drob2,&drobotvet); //вызов деления
}
//=================================================
else
{
    printf("Что-то пошло не так =/\n"); //если пользователь ввел что-то страшное
}
//=================================================
}