#include <stdio.h>
#include <stdlib.h>

int main()
{
	//Задать случайно элементы двумерного динамического массива a. Размер массива вводит пользователь. 
	float **a;//двумерый массив "C" с типом float для вычислений с дробной частью
	int nol = 0;// указатель на массив, размерности массива
	int *b;//одномерный массив a
	int *c;//одномерный массив b
	int i, j , n , m;// индексы элементов матрицы
	FILE *fp = fopen("f1.txt","r");//открытие файла f1.txt на чтение(должен быть создан заранее)
	FILE *fp2 = fopen("f2.txt","w");//открытие файла f2.txt на запись(если его нет,он создается программой)
	if(fp != NULL) //если найден первый файл
	{ 
		fscanf(fp,"%d",&n);//сканирование размерности
		printf("n = %d\n",n);//вывод размерности
	} 
	else 
	{
		printf("Невозможно открыть файл на чтение.\n "); //ошибка если файла нет
		fclose(fp); //закрытие файла
		return 0; 
	}
	m=n;//для удобства работы с квадратной матрицей 
	a = (float**)malloc(n * sizeof(float*));// выделяем память для столбцов в двумерном массиве C
	b = (int*)malloc(n * sizeof(int));// выделяем память под одномерный массив A
	c = (int*)malloc(n * sizeof(int));// выделяем память под одномерный массив B
	if (!a)// если ошибка и столбцы двумерного массива имеют размеры 0 или меньше, то выходим из программы
	{
		printf("Error: there is no memory.\n");
		return 0;
	}
	for (i = 0; i < n; ++i)// цикл выделения памяти для строк в двумерном массиве
	{
		a[i] = (float*)malloc(m * sizeof(float));//выделяем строкам память
		if (!a[i])// если ошибка и  размеры строк имеют размер 0 или меньше, то освобождаем память и выходим из программы
		{
			for (j = 0; j < i; ++j)//цикл для очистки
				free(a[j]);//освобождаем строки
			free(a);//освобождаем массив столбцов
			printf("Error: there is no memory.\n");
			return 0;
		}
	}
	for (i = 0; i < n; i++)// вводим элементы массива A
	{
		fscanf(fp,"%d",&b[i]);//сканирование элемента одномерного массива из файла
	}
	for (i = 0; i < n; i++)// вводим элементы массива B
	{
		fscanf(fp,"%d",&c[i]);//сканирование элемента одномерного массива из файла
	}
	//Требуется сформировать двумерный динамический массив a
	printf("Введенный массив a:\n");
	for (i = 0; i < n; ++i)//Вывод одномерного массива A в консоль для проверки
	{
		printf("%d ", b[i]);
	}
	printf("\n");
	printf("Введенный массив b:\n");
	for (i = 0; i < n; ++i)//Вывод одномерного массива B в консоль для проверки
	{
		printf("%d ", c[i]);
	}
 	for(i=0;i<n;i++)//выполняем задание,цикл двумерный матрицы по строкам
 	{
	 	for(j=0;j<m;j++)//цикл по столбцам
    	{
			if(b[j]!=0)//если элемент массив A не равен 0
			{
				a[i][j] = (float)b[i]/c[j];//присваиваем значение деление массива A на массив B
			}
			else 
			{
				a[i][j]=nol;//иначе присваиваем 0, но тут какой костыль.Что через перменную, что через NULL или 0, значение выводится не совсем корректно, но это не смертельно
			}
		}
 	}
 	printf("\n");
	printf("Матрица после решения находится в файле f2.txt \n");
 	for (i = 0; i < n; i++)  // цикл по строкам
  	{
    	for (j = 0; j < m; j++)  // цикл по столбцам
    	{
     		fprintf(fp2,"%6.2f",a[i][j]); //Вводим в файл элементы матрицы, после точки будет два числа
    	}
    	fprintf(fp2,"\n");
  	}
	//освобождаем захваченную память
	for (i = 0; i < n; ++i)
		free(a[i]);//освобождаем строки в матрице
	free(a);//освобождаем столбцы в матрице
	free(b);//осовобождаем одномерный массив A
	free(c);//освобождаем одномерный массив B
	return 1;
	}