#include <stdio.h>
#include <stdlib.h>

int main()
{
//Задать случайно элементы двумерного динамического массива a. Размер массива вводит пользователь. 
//========================================
float **a;//двумерный массив с указателями
int nol = 0;
int *b;//одномерный массив с указателями
int *c;//одномерный массив с указателями
int i, j , n , m;// индексы элементов матрицы
FILE *fp ;//объявление бинарного файла
FILE *fp2;//объявление обычного файла
//========================================
	printf("Введите n\n"); // ввод размерности массива
	scanf("%d",&n);
	fp = fopen("f1.bin","wb");//откурытие бинарного файла на запись
	m=n;//делаем квадратную матрицу(мне так удобно)
//выделяем память для указателей на строки
	a = (float**)malloc(n * sizeof(float*));
//выделяем память под одномерные массивы
	b = (int*)malloc(n * sizeof(int));
	c = (int*)malloc(n * sizeof(int));
// если двумерный массив размером 0, то, ошибка выходим из программы
if (!a)
{
	printf("Error: there is no memory.\n");
return 0;
}
// выделяем память для строк в двумерной матрице
for (i = 0; i < n; ++i)
{
a[i] = (float*)malloc(m * sizeof(float));
// если не можем выделить, то освобождаем память и выходим из программы
if (!a[i])
{
for (j = 0; j < i; ++j)
free(a[j]);
free(a);
printf("Error: there is no memory.\n");
return 0;
}
}
//========================================
// вводим элементы массива
for (i = 0; i < n; i++){
	b[i] = rand()%10; // рандомный элемент для массива b
		fwrite(&b[i],sizeof(int),1,fp); //запись его в бинарник
	}
for (i = 0; i < n; i++){
c[i] = rand()%10; //рандомный желемент для массива c
		fwrite(&c[i],sizeof(int),1,fp);//запись его в бинарник
	}
fclose(fp); //закрываем файл 
//========================================
	fp = fopen("f1.bin","rb");//открываем его на чтение 
for (i = 0; i < n; i++){//цикл для чтения масива b
	fread(&b[i], sizeof(int), 1, fp);//чтение массива b из бинарного файла
	}
for (i = 0; i < n; i++){//цикл для чтения массива с
	fread(&c[i], sizeof(int), 1, fp);//чтение массива c из бинарного файла
	}
fclose(fp);
//========================================
//Требуется сформировать двумерный динамический массив a
fp2 = fopen("f2.txt","w");//открываем второй файл на запись
printf("Введенный массив a:\n");
	for (i = 0; i < n; ++i)
		{
			printf("%d ", b[i]);
		}
		printf("\n");
printf("Введенный массив b:\n");
	for (i = 0; i < n; ++i)
		{
			printf("%d ", c[i]);
		}
//========================================
//циклы для решения задачи
for(i=0;i<n;i++)
 {
	for(j=0;j<m;j++)
    {
		if(b[j]!=0)
		{
			a[i][j] = (float)b[i]/c[j];
		}
		else 
		{
			a[i][j]=nol;
		}
	}
 }
//========================================
printf("\n");
printf("Матрица после решения находится в файле f2.txt \n");
 for (i = 0; i < n; i++)
  {
    for (j = 0; j < m; j++)
    {
     	fprintf(fp2,"%6.2f",a[i][j]);//запись в файл
		printf("%6.2f",a[i][j]);//вывод в консоль
    }
    	fprintf(fp2,"\n");//запись в файл
    	printf("\n");//вывод в консоль
  }
fclose(fp2);//закрытие файла
//========================================
// освобождаем захваченную память
for (i = 0; i < n; ++i)
	free(a[i]);
free(a);
free(b);
free(c);return 1;
}
//========================================
/*
создать f1.bin
создать f2.txt
*/