#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main()
{
	//Задать случайно элементы двумерного динамического массива a. Размер массива вводит пользователь. 
//========================================
int **a, n, m;// указатель на массив, размерности массива
int *b, nm;//указатель на массив, размерность массива
int schet=0,i, j,colvchet;// индексы элементов матрицы
FILE *fp;//указатель на бинарный файл
FILE *fp2;//указатель на файл который будет записан
//========================================
printf("введите n \n");//ввод размера матрицы
scanf("%d",&n);
fp = fopen("f1.bin","wb");//открытие бинарного файла на запись
m=n;//делаем квардратную матрицу
nm = m*n;//вычисляем количество символов в матрице
//выделяем память для указателей на строки
a = (int**)malloc(n * sizeof(int*));
//выделяем память под массив
b = (int*)malloc(nm * sizeof(int));
//если n=0 или ее нет, то выходим из программы
if (!a)
{
	printf("Error: there is no memory.\n");
return 0;
}
//выделяем память для строк
for (i = 0; i < n; ++i)
{
	a[i] = (int*)malloc(m * sizeof(int));
// если m=0 или ее нет, то освобождаем память и выходим из программы
	if (!a[i])
	{
		for (j = 0; j < i; ++j)
		free(a[j]);
		free(a);
		printf("Error: there is no memory.\n");
		return 0;
	}
}
//========================================
// вводим элементы массива
for (i = 0; i < n; ++i)
for (j = 0; j < m; ++j)
	{
		a[i][j] = rand()%10;//рандомное значение элемента
		fwrite(&a[i][j],sizeof(int),1,fp);//запись значения в бинарный файл
	}
fclose(fp);//закрытие бинарного файла
fp = fopen("f1.bin","rb");//открытие бинарного файла на чтение
for (i = 0; i < n; i++){
	for(j=0;j < m;j++){
		fread(&a[i][j], sizeof(int), 1, fp);//чтение из бинарного файла
	}
}
fclose(fp);//закрытие файла
//========================================
//Требуется сформировать одномерный динамический массив с, переписав в него вначале четные строки массива a, затем нечетные.
printf("Двумерный берется из файла f1.bin:\n");
for (i = 0; i < n; ++i)
	{
	for (j = 0; j < m; ++j)
		printf("%d ", a[i][j]);//печать матрицы
		printf("\n");
	}

for (i = 0; i<n ; ++i){ //решение задачи
	if(i%2==0)
	{
		for ( j = 0; j<m; ++j)
		{
			b[schet]=a[i][j];
			schet++;
		}
	}
}
for (i = 0;i<n;++i)
{
	if(i%2!=0)
	{
		for(j=0;j<m;j++)
		{
			b[schet]=a[i][j];
			schet++;
		}
	}
}
//========================================
fp2 = fopen("f2.txt","w"); //открытие второго файла на чтение
printf("Одномерный находится в файле f2.txt: "); 
for (i = 0; i < nm; ++i){
	 fprintf(fp2,"%2d",b[i]);//запись значения в файл
     printf("%2d",b[i]);//вывод в консоль
}
fclose(fp2);//закрытие файла
return 1;
//========================================
// освобождаем захваченную память
for (i = 0; i < n; ++i)
	free(a[i]);
free(a);
free(b);
return 1;
}
//========================================
/*
создать f1.bin
создать f2.txt
*/